1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаСписанияНоменклатурыПодЗаказ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСписанияНоменклатурыВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипыСписанияНоменклатурыВПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипыСписанияНоменклатурыВПроизводство</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеВЦеховуюКладовую</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
Объект.ДополнительныеРеквизиты.Очистить();
Для каждого ДопРеквизит Из Объект.ВидНоменклатуры.НаборСвойств.ДополнительныеРеквизиты Цикл
	
	НовыйРеквизит= Объект.ДополнительныеРеквизиты.Добавить();
	НовыйРеквизит.Свойство=ДопРеквизит.Свойство;
	
КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию,ЗначениеКопирования=Неопределено)
	
	
		СхемаКомпоновкиДанных = Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ПолучитьМакет("ОтборПоУсловию");
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПоусловию.Инициализировать(ИсточникНастроек);
		
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ТекНастройки = Параметры.ЗначениеКопирования.ОтборНастройки.Получить();
	Иначе
		ТекНастройки = Объект.Ссылка.ОтборНастройки.Получить();

	КонецЕсли;
	
	
	Если ТекНастройки = Неопределено Тогда
		
		ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
	Объект.ВидНоменклатуры=Объект.Родитель.ВидНоменклатуры;
	КонецЕсли;
	ИнициализироватьКомпоновкуДанных(Ложь,Параметры.ЗначениеКопирования);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 29.12.2018
	Если Объект.СложнаяНастройка Тогда
		Элементы.Простая.Видимость=Ложь;
		Элементы.Сложная.Видимость=Истина;
	Иначе
		Элементы.Простая.Видимость=Истина;
		Элементы.Сложная.Видимость=Ложь;

	КонецЕсли;
	
	Если Объект.ТипСписания=ПредопределенноеЗначение("Перечисление.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию") Тогда
		Элементы.КатегорияЭксплуатации.Видимость=Истина;
	Иначе
		Элементы.КатегорияЭксплуатации.Видимость=Ложь;
	КонецЕсли;
	
	
КонецПроцедуры //-Лико m.shenderov 29.12.2018


&НаКлиенте
Процедура СложнаяНастройкаПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		УстановитьВидимость();

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


Если ТекущийОбъект.СложнаяНастройка Тогда
	 ТекущийОбъект.Описание=Строка(ОтборПоусловию.Настройки.Отбор);
	 ТекущийОбъект.ОтборНастройки = Новый ХранилищеЗначения(ОтборПоусловию.Настройки, Новый СжатиеДанных(9));
 Иначе
	 ТекущийОбъект.ОтборНастройки = Неопределено;

КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КатегорияЭксплуатацииПриИзменении(Элемент)
	
	
КонецПроцедуры


&НаКлиенте
Процедура ТипСписанияПриИзменении(Элемент)
	УстановитьВидимость();
	Если Не Объект.ТипСписания=ПредопределенноеЗначение("Перечисление.Лико_ТипыСписанияНоменклатурыВПроизводство.ПередачаВЭксплуатацию") Тогда
		
		Объект.КатегорияЭксплуатации=Неопределено;

	КонецЕсли;
	
КонецПроцедуры
